{"_id":"Bramleyandpecancheesecake","preptime":"20","servings":"6","keywords":["diet@peanut-free","main ingredient@cheese","diet@corn-free","occasion@entertaining","diet@citrus-free","diet@yeast-free","diet@shellfish-free","meal type@desserts","warning@raw egg","cook method@no cooking","convenience@add pasta for a complete meal","warning@nuts","diet@egg-free","occasion@prepare-ahead entertaining"],"subtitle":"This spectacular looking cheesecake is simpler than you think to produce - and the little extra time spent on making the jelly topping is well worth the effort as it gives such a professional looking finish.","totaltime":"200","cooktime":"0","ingredients":[{"ingredient":"ground cinnamon","measure":"2 tsp"},{"ingredient":"apple juice","measure":"300 ml"},{"ingredient":"cream cheese","measure":"350 g"},{"ingredient":"butter","measure":"150 g"},{"ingredient":"double cream","measure":"300 ml"},{"ingredient":"gelatine","measure":"1 sachet"},{"ingredient":"water","measure":"90 ml"},{"ingredient":"pecan halves","measure":"150 g"},{"ingredient":"chopped pecans","measure":"150 g"},{"ingredient":"gelatine","measure":"30 g"},{"ingredient":"bramley apple puree","measure":"300 ml"},{"ingredient":null,"measure":""},{"ingredient":"ginger biscuits","measure":"150 g"},{"ingredient":null,"measure":""},{"ingredient":null,"measure":""}],"method":[{"step":"1","text":"Oil a 23 cm loose-based cake tin. Mix chopped nuts, biscuits and melted butter together and spoon into cake tin. Press evenly over base with back of a spoon. Chill while you make the filling."},{"step":"2","text":"Dissolve the gelatine in the water according to pack instructions. Put the cheese, Bramley puree and cinnamon in a bowl and beat until smooth. Beat in the gelatine. Fold in the whipped cream and turn into the prepared tin. Chill for 3-1 days or until set."},{"step":"3","text":"Make the topping by dissolving the gelatine in 60 ml of the apple juice, quantity as pack instructions.  Stir this into the remaining apple juice and chill until just beginning to thicken slightly to the consistency of egg white."},{"step":"4","text":"Pour a thin layer of jelly on the top of the cheesecake and arrange the pecan halves on top and chill for about 30 min until set.. At this stage do not return the remainder of the jelly to the fridge as you need to keep it quite liquid."},{"step":"5","text":"When set, pour the remaining jelly over the nuts and chill for another 3-1 days or until set."},{"step":"6","text":"To unmould, hold a very hot wet tea towel around the outside of the cake tin for about 1 min. Run a thin bladed knife around the inside of the tin to loosen the cheesecake. Now you should be able to push up the cheesecake on the base of the tin, leaving the sides of the tin behind. Leave on the tin base and transfer to a serving plate and cut into wedges."}],"title":"Bramley and pecan cheesecake"}