{"_id":"Celebrationcheesecake","preptime":"20","servings":"6","keywords":["diet@vegetarian","cook method.hob, oven, grill@oven","diet@peanut-free","diet@corn-free","occasion@entertaining","diet@yeast-free","occasion@buffet party","diet@shellfish-free","meal type@desserts","diet@demi-veg","occasion@prepare-ahead entertaining"],"subtitle":"Flavoured with the tang of lemon.","totaltime":"105","cooktime":"55","ingredients":[{"ingredient":"shortcrust pastry","measure":"225 g"},{"ingredient":"cream cheese","measure":"225 g"},{"ingredient":"eggs","measure":"3"},{"ingredient":"single cream","measure":"150 ml"},{"ingredient":"vanilla essence","measure":"1 tsp"},{"ingredient":"lemon","measure":""},{"ingredient":"caster sugar","measure":"175 g"},{"ingredient":"plain flour","measure":"25 g"}],"method":[{"step":"1","text":"Roll out the pastry on a lightly floured surface. Use to line a 25 cm round or petal shaped flan ring. Trim off any excess pastry. Chill for 30 min. "},{"step":"2","text":"Preheat oven to 200&deg;C."},{"step":"3","text":"Remove the flan ring from the fridge, line with greaseproof paper and baking beans and bake blind for 10-15 min. Then remove the paper and beans and cook for a further 5 min or until crisp. "},{"step":"4","text":"Meanwhile, beat the cream cheese in a bowl until very soft. Sift in the flour and stir until well mixed. Beat the egg yolk and sugar together until thick and pale. Fold into the cream cheese mixture with the vanilla, lemon rind and juice and finally the cream. "},{"step":"5","text":"Whisk the egg white until stiff. Using a large metal spoon, carefully fold into the filling mixture. Reduce the oven temperature to 170&deg;C."},{"step":"6","text":"Pour the filling into the part-baked pastry case, smoothing over the surface. Cook in the oven for 40-45 min or until just set. Turn off the oven and leave the cheesecake to cool in the oven with the door slightly ajar, to help prevent the cheesecake from cracking. "},{"step":"7","text":"Remove the cheesecake from the flan ring and place on a serving plate. Serve well chilled in slices. "}],"title":"Celebration cheesecake"}