{"_id":"CrispyPeking-styleduckpancakes","preptime":"30","servings":"6","keywords":["diet@dairy-free","diet@peanut-free","special collections@classic recipe","diet@corn-free","meal type@starters","occasion@entertaining","diet@citrus-free","diet@shellfish-free","cuisine@asian.chinese","main ingredient@poultry","meal type@main","cook method.hob, oven, grill@hob / oven","diet@egg-free","diet@cow dairy-free"],"subtitle":"This Chinese favourite is wonderfully tasty, as a main meal or a starter. Great for entertaining.","totaltime":"180","cooktime":"120","ingredients":[{"ingredient":"sesame oil","measure":"3 tsp"},{"ingredient":"duckling (#)","measure":""},{"ingredient":"clear honey","measure":"6 tsp"},{"ingredient":"plain flour","measure":"450 g"},{"ingredient":"water","measure":"350 ml"},{"ingredient":"water","measure":"3 tsp"},{"ingredient":"cucumber","measure":"1"},{"ingredient":null,"measure":""},{"ingredient":"salad onions","measure":"1 bunch"},{"ingredient":"plum sauce","measure":"60 ml"}],"method":[{"step":"1","text":"Preheat oven to 200&deg;C."},{"step":"2","text":"Pour boiling water over the duckling, turning over to evenly coat and seal the skin. Wipe duckling with kitchen towel to dry. Brush with honey until glazed all over. "},{"step":"3","text":"Place the duck, breast side up, in a roasting tin on a wire rack. Roast in oven, without basting, for 15 min per 450 g, until the duck is tender and cooked through and the skin is dark and crispy. "},{"step":"4","text":"Meanwhile, sift the flour into a bowl, pour in the cold water, stirring until well mixed. Turn out onto a lightly floured surface and knead until smooth. Cover bowl with a damp cloth and leave to stand for 30 min. "},{"step":"5","text":"Divide dough into 4 equal portions. Shape into long sausage shapes and cut each into 9 small pieces. Shape each into a ball and flatten out to form a 15 cm circle. Brush the top and bottom of each pancake very lightly with a little sesame oil."},{"step":"6","text":"Heat a heavy-based non-greased frying pan over a medium heat until hot. Cook each pancake for 1-2 min, or until puffed up and light brown spots appear on the underside. Flip over and cook the other side. Remove from pan and stack on a plate, covering with a cloth until all are cooked. Then steam the pancakes over a pan of simmering water for 8-10 min, or until piping hot. "},{"step":"7","text":"Meanwhile, carve duck by removing the legs and cutting the meat from the breast downwards. Cut the meat into small strips and serve on a warmed serving plate with the steamed pancakes, prepared vegetables and plum sauce. "},{"step":"8","text":"To serve, simply spread the pancake with the sauce, top with a little shredded meat and vegetables and roll up. "}],"title":"Crispy Peking-style duck pancakes"}