{"_id":"Icedsatsumacups","preptime":"20","servings":"8","keywords":["cuisine@british contemporary","cook method.hob, oven, grill@oven","diet@peanut-free","diet@corn-free","occasion@entertaining","diet@shellfish-free","meal type@desserts","main ingredient@fruit","occasion@prepare-ahead entertaining"],"subtitle":"An attractive dessert to make. Crispy biscuit cups served with a delicious tangy yogurt ice.","totaltime":"205","cooktime":"5","ingredients":[{"ingredient":"greek yogurt","measure":"375 g"},{"ingredient":"powdered gelatine","measure":"1 tsp"},{"ingredient":"orange","measure":""},{"ingredient":"caster sugar","measure":"50 g"},{"ingredient":null,"measure":""},{"ingredient":"butter","measure":"50 g"},{"ingredient":"caster sugar","measure":"50 g"},{"ingredient":"egg whites","measure":"2"},{"ingredient":"cointreau","measure":"45 ml"},{"ingredient":null,"measure":""},{"ingredient":"satsumas","measure":"4"},{"ingredient":"rind of # lemon","measure":""},{"ingredient":"flour","measure":"50 g"},{"ingredient":null,"measure":""},{"ingredient":"satsumas","measure":"2"}],"method":[{"step":"1","text":"Preheat oven to 200&deg;C. Grease two non-stick baking sheets, or line two ordinary trays with non-stick paper."},{"step":"2","text":"Cream butter and sugar into bowl until creamy pale and fluffy. Add egg white and flour and beat until thoroughly incorporated. "},{"step":"3","text":"Place 2 tablespoons of the mixture, spaced well apart on one tray and spread thinly to a diameter of 10 cm. Bake for 5 min until biscuits are lightly golden. While they are cooking, prepare another two on the second tray. "},{"step":"4","text":"Remove cooked biscuits from tray with palette knife and mould over a ramekin or a small rounded bottom glass. Work quickly as the biscuits become crisp as soon as they cool. If they harden too fast, return to oven to soften. Bake and shape the rest of the biscuits. Store cups in an airtight tin."},{"step":"5","text":"Put orange juice into a cup, sprinkle over gelatine then stand in a pan with a little simmering water and stir until dissolved. Remove from pan, stir in sugar and leave to cool. "},{"step":"6","text":"Meanwhile, segment satsumas and remove membranes from each segment. (Do not worry if the flesh breaks up)."},{"step":"7","text":"Put the yogurt into a bowl with grated orange and lemon rind. Beat together, then stir in the gelatine mixture. Fold in satsumas and Cointreau (if using) then place in freezer. "},{"step":"8","text":"After 1 hour, stir mixture to break down the ice crystals return to freezer and leave until hard."},{"step":"9","text":"Before serving, place iced yogurt in the fridge for 45 min to soften slightly. Scoop out into the biscuit cups. Garnish with extra satsuma segments if wished."}],"title":"Iced satsuma cups"}