{"_id":"Lemonandsultanablintzes","preptime":"15","servings":"8","keywords":["diet@vegetarian","cook method.hob, oven, grill@hob","diet@peanut-free","diet@corn-free","special collections@cheffy recommended","occasion@entertaining","diet@yeast-free","diet@shellfish-free","meal type@desserts","diet@demi-veg","occasion@prepare-ahead entertaining"],"subtitle":"Blintz crepes should be made as thin as possible. They are then filled with a sweetened curd cheese, lemon and sultana mixture and fried in butter to make a delicious dessert.","totaltime":"37","cooktime":"22","ingredients":[{"ingredient":"milk","measure":"300 ml"},{"ingredient":null,"measure":""},{"ingredient":null,"measure":""},{"ingredient":null,"measure":""},{"ingredient":"caster sugar","measure":"6 tsp"},{"ingredient":"caster sugar","measure":"1-2 tsp"},{"ingredient":"egg yolk","measure":"1"},{"ingredient":"oil","measure":"3 tsp"},{"ingredient":"butter","measure":"3 tsp"},{"ingredient":"sultanas","measure":"50 g"},{"ingredient":"butter","measure":"3 tsp"},{"ingredient":"seasoning","measure":""},{"ingredient":"curd cheese","measure":"450 g"},{"ingredient":"plain flour","measure":"100 g"},{"ingredient":"rind of # lemon","measure":""},{"ingredient":"rind of # lemon","measure":""},{"ingredient":"egg","measure":"1"},{"ingredient":"egg","measure":"1"}],"method":[{"step":"1","text":"Sift the flour and seasoning into a bowl. Make a well in the centre and add the egg, egg yolk and half the milk. Using a wooden spoon, stir from the centre, gradually drawing in the flour from around the sides of the bowl. Beat well to form a smooth batter. Add the remaining milk and melted butter or oil."},{"step":"2","text":"Lightly grease a 23 cm heavy-based frying pan by wiping the pan with a piece of kitchen paper smeared in oil. Heat the pan and pour in a small amount of batter. Tilt the pan until the bottom is coated and cook over a medium heat until the edges of the pancake curl up and the top surface is dry. Turn the pancake out, cooked side up, onto kitchen paper. Repeat until all the batter is used up."},{"step":"3","text":"Beat the cream cheese until smooth. Mix in the egg and sugar. Lastly fold in the sultanas and lemon rind. "},{"step":"4","text":"Divide the curd cheese mixture between the pancakes, spooning it in the centre of the blintz, cooked side up. Fold the sides of the pancake into the centre, then roll up to encase the filling completely and form a neat parcel."},{"step":"5","text":"Heat a little butter in a frying pan and cook the blintzes for 3-5 minutes in batches, turning occasionally until brown and crisp on all sides. Drain well on kitchen paper and keep warm while frying the remainder."},{"step":"6","text":"Serve immediately, decorated with lemon rind and dredged with caster sugar."}],"title":"Lemon and sultana blintzes"}