{"_id":"Lusciouslayercake","preptime":"95","servings":"8","keywords":["diet@vegetarian","diet@peanut-free","diet@citrus-free","diet@shellfish-free","diet@demi-veg","meal type@cakes, biscuits, sweets.occasion cakes","cook method.hob, oven, grill@hob / oven","occasion@easter"],"subtitle":"A totally yummy chocolate cake with a plain and white chocolate filling and a milk chocolate coating. Decorate with mini Easter eggs for a special Easter time treat.","totaltime":"161","cooktime":"36","ingredients":[{"ingredient":"caster sugar","measure":"100 g"},{"ingredient":"cocoa powder","measure":"6 tsp"},{"ingredient":"cornflour","measure":"25 g"},{"ingredient":"double cream","measure":"600 ml"},{"ingredient":"milk chocolate","measure":"400 g"},{"ingredient":"milk","measure":"6 tsp"},{"ingredient":"plain chocolate","measure":"200 g"},{"ingredient":"plain flour","measure":"25 g"},{"ingredient":"self-raising flour","measure":"25 g"},{"ingredient":"tia maria","measure":"6 tsp"},{"ingredient":"unsalted butter","measure":"175 g"},{"ingredient":"white chocolate","measure":"200 g"},{"ingredient":"eggs","measure":"3"},{"ingredient":null,"measure":""},{"ingredient":null,"measure":""}],"method":[{"step":"1","text":"Preheat oven to 190&deg;C. Lightly grease and line a 23 cm round spring-clip cake tin"},{"step":"2","text":"Beat eggs in a bowl until thick and creamy. Gradually beat in sugar until well mixed. Sift together the cornflour, self-raising flour, plain flour and cocoa powder. Fold into the egg mixture. Stir in the Tia Maria and milk. Spoon the mixture into the cake tin and smooth over the surface. "},{"step":"3","text":"Bake for 30 min or until firm. Remove from oven and leave to cool in the tin for a while before turning out on a wire rack to cool completely."},{"step":"4","text":"Place the white and plain chocolate in separate heatproof bowls over pans of simmering water. Heat for 3-5 min or until melted. Remove from heat and leave to cool slightly. Place the cream in a bowl and whisk until firm. Divide the cream into 2 equal amounts. When cooled, stir the white melted chocolate into one half of the whipped cream and the plain into the other - to give a white and plain chocolate filling. "},{"step":"5","text":"Cut the cake in half through the centre. Spread one half with half the white chocolate filling, then the plain chocolate filling and then the remaining white chocolate to form 3 layers. Top with the other cake half and place on a serving plate. Chill for 1 hour or until firm."},{"step":"6","text":"Meanwhile, place the milk chocolate in a heatproof bowl and heat for 3-5 min or until melted. Place the butter in a small pan and heat until melted. Mix together the melted chocolate and butter until smooth. Leave to cool, stirring occasionally, until spreadable. "},{"step":"7","text":"Using half the topping icing, spread over the sides and top of the cake. Spoon the other half into a piping bag fitted with a star nozzle and pipe around the bottom edge of the cake. Serve in slices."}],"title":"Luscious layer cake"}