{"_id":"Pastrywrappedstuffedapples","preptime":"45","servings":"4","keywords":["diet@vegetarian","cuisine@british contemporary","cook method.hob, oven, grill@oven","diet@peanut-free","diet@corn-free","occasion@entertaining","diet@yeast-free","diet@shellfish-free","meal type@desserts","diet@demi-veg","occasion@prepare-ahead entertaining"],"subtitle":"Not only does this dish look superb it is a fantastic alternative to the traditional apple pie.","totaltime":"75","cooktime":"30","ingredients":[{"ingredient":"dates","measure":"4"},{"ingredient":"granulated sugar","measure":"50 g"},{"ingredient":"shortcrust pastry","measure":"550 g"},{"ingredient":"egg white","measure":"1"},{"ingredient":"caster sugar","measure":"2 tsp"},{"ingredient":"dried apricots","measure":"50 g"},{"ingredient":"glace cherries","measure":"50 g"},{"ingredient":"juice of # lemon","measure":""},{"ingredient":"cooking apples","measure":"4"}],"method":[{"step":"1","text":"Preheat oven to 200&deg;C. "},{"step":"2","text":"Using an apple corer, remove the apple cores. Brush the insides of the apple with the lemon juice to help prevent discolouration. "},{"step":"3","text":"In a bowl, mix together the cherries, apricots, dates and sugar. Set aside. "},{"step":"4","text":"Divide the pastry into individual portions. Roll each piece out to a round big enough to totally wrap the apples in, using a saucer to cut around if necessary."},{"step":"5","text":"Place the apples in the centre of each round of pastry. Fill the centre of each apple with the fruit filling mixture, packing it in tightly. "},{"step":"6","text":"Brush the edges of the pastry rounds with water. Carefully bring up around the apple so that each is totally encased. Press the edges together to form a seam and seal."},{"step":"7","text":"Transfer the pastry wrapped apples to a lightly greased baking tray with the join underneath. Use any trimmings to make into leaves to decorate the apples. "},{"step":"8","text":"Using a little cold water to attach, decorate the tops with the pastry leaves. Brush all over with the egg white. Sprinkle with the caster sugar. Cook in the oven for 30-35 min or until crisp and golden. Serve immediately. "}],"title":"Pastry wrapped stuffed apples"}