{"_id":"Petticoattailsshortbread","preptime":"25","servings":"8","keywords":["diet@vegetarian","cook method.hob, oven, grill@oven","diet@peanut-free","special collections@classic recipe","cuisine@british traditional","diet@corn-free","diet@citrus-free","diet@yeast-free","meal type@cakes, biscuits, sweets","diet@shellfish-free","diet@demi-veg","diet@egg-free","special collections@store cupboard"],"subtitle":"A traditional Scottish shortbread recipe. They make a delightful, thoughtful gift for family or friends.","totaltime":"40","cooktime":"15","ingredients":[{"ingredient":"ground rice","measure":"50 g"},{"ingredient":"caster sugar","measure":"75 g"},{"ingredient":"caster sugar","measure":"10 g"},{"ingredient":"rice flour","measure":"50 g"},{"ingredient":"unsalted butter","measure":"150 g"},{"ingredient":"plain flour","measure":"175 g"}],"method":[{"step":"1","text":"Preheat oven to 160&deg;C"},{"step":"2","text":"Mix the flour with the rice flour or ground rice. Add half the sugar to the flour mixture. Rub in the butter until the mixture is like very fine breadcrumbs. "},{"step":"3","text":"Stir in the rest of the sugar. Knead well but lightly, until the ingredients bind together. Work in a little extra flour, so it is easy to roll the dough thinly. Knead until very smooth. "},{"step":"4","text":"Put onto a lightly floured surface and roll out until a large round of only 6mm thickness. "},{"step":"5","text":"Tidy the edges, carefully. Place on greaseproof paper or baking parchment on a baking tray. Carefully mark a small circle in the centre, do not cut right through the dough. Mark the band around the circle into 8 equal triangular portions, again taking care not to cut right through the dough. Prick all over with a skewer. "},{"step":"6","text":"Bake for approximately 15 min. Allow to become quite cold before removing from the baking tray. Separate into portions. Dust with caster sugar before serving. Store in an airtight tin, protected with layers of greaseproof paper as these biscuits are very fragile. "}],"title":"Petticoat tails shortbread"}