{"_id":"Raisedporkpie","preptime":"60","servings":"8","keywords":["cuisine@european.british","cook method.hob, oven, grill@oven","diet@peanut-free","special collections@classic recipe","diet@corn-free","occasion@entertaining","diet@citrus-free","diet@yeast-free","occasion@buffet party","diet@shellfish-free","occasion@picnic","main ingredient@meat","convenience@serve with salad for complete meal","meal type@lunch / snacks","occasion@prepare-ahead entertaining","special collections@weekday meal"],"subtitle":"Despite appearances, this recipe is actually fairly simple, and the end result is definitely worth the effort. Great for picnics and buffet lunches.","totaltime":"645","cooktime":"105","ingredients":[{"ingredient":"garlic","measure":"2 cloves"},{"ingredient":"seasoning","measure":""},{"ingredient":"fresh thyme","measure":"3 tsp"},{"ingredient":"fresh sage","measure":"3 tsp"},{"ingredient":"rindless smoked bacon","measure":"50 g"},{"ingredient":"eggs","measure":"4"},{"ingredient":"gelatine","measure":"2 tsp"},{"ingredient":"vegetable stock","measure":"250 ml"},{"ingredient":null,"measure":""},{"ingredient":"plain flour","measure":"450 g"},{"ingredient":"lard","measure":"100 g"},{"ingredient":"salt","measure":"1 tsp"},{"ingredient":"lean pork","measure":"675 g"},{"ingredient":"onion","measure":"1"},{"ingredient":"red-skinned apple","measure":"1"},{"ingredient":"milk","measure":"100 ml"},{"ingredient":"water","measure":"75 ml"},{"ingredient":null,"measure":""},{"ingredient":"egg","measure":"1"}],"method":[{"step":"1","text":"Preheat oven to 200&deg;C. Lightly grease a 20 cm round spring-clip cake tin."},{"step":"2","text":"Mince half the pork with the onion and apple in a food processor. Transfer to a bowl. Mix in the garlic, seasoning and herbs. Finely chop the remaining pork with the bacon. Stir into the minced mixture. "},{"step":"3","text":"Sift the flour and salt into a bowl; make a well in the centre. Place the lard, milk and water in a pan. Heat until the fat dissolves, then bring to the boil. Pour the liquid into the well. Stir in quickly to make a soft dough."},{"step":"4","text":"On a lightly floured surface, knead the dough lightly until smooth. Put a quarter of the dough in a bowl, covered with a cloth. Roll out the remaining dough. Use to line the cake tin, smoothing evenly into base and sides. "},{"step":"5","text":"Spoon half the pork mixture into the pastry case with the hard-boiled eggs on top. Spoon over the remaining pork mixture, making sure it is evenly packed. "},{"step":"6","text":"Roll out the remaining pastry to a round, large enough to top the pie. Dampen the pastry edges with a little water then press the edges together to seal. Trim off any excess pastry to decorate, using a little cold water to attach, and crimp the edges of the pie."},{"step":"7","text":"Place the pie on a baking tray. Brush the top with beaten egg. Make a hole in the centre of the lid for steam to escape. Insert a small rolled up piece of greaseproof paper into the hole, to act as a chimney."},{"step":"8","text":"Cook in oven for 30 min. Reduce temperature to 160&deg;C and cook for a 1hr 15 min, cover the top with foil if it browns too much. "},{"step":"9","text":"Remove from oven. Leave to cool completely. Dissolve the gelatine in the stock. Insert a funnel into the roll of paper and, very slowly, pour as much of the stock as possible into the pie."},{"step":"10","text":"Leave to chill for several hours or overnight. Turn out and serve in slices. "}],"title":"Raised pork pie"}