{"_id":"Scrumptioussummerpudding","preptime":"25","servings":"6","keywords":["diet@vegetarian","cook method.hob, oven, grill@hob","diet@dairy-free","diet@peanut-free","diet@corn-free","occasion@entertaining","diet@citrus-free","diet@shellfish-free","meal type@desserts","diet@vegan","diet@demi-veg","diet@egg-free","diet@cow dairy-free","special collections@family puds","occasion@prepare-ahead entertaining"],"subtitle":"A pudding basin is liined with bread, filled with strawberries and apples then topped with bread. The pudding is then left in the fridge to allow the juices to soak through the bread.","totaltime":"513","cooktime":"8","ingredients":[{"ingredient":"caster sugar","measure":"150 g"},{"ingredient":"port","measure":"3 tsp"},{"ingredient":"water","measure":"100 ml"},{"ingredient":"white bread","measure":"8 slices"},{"ingredient":"strawberries","measure":"225 g"},{"ingredient":"cooking apples","measure":"225 g"}],"method":[{"step":"1","text":"Lightly grease a 1 <sup>1</sup>/<sub>8</sub> l / 2 pt pudding basin."},{"step":"2","text":"Cut 6 of the bread slices into strips and, with the remaining 2: cut one round to fit the base of the basin; and another larger round to top the pudding basin once filled with fruit."},{"step":"3","text":"Roll each bread strip with a rolling pin to compact it slightly. (This helps to prevent the bread from falling apart when turning the pudding out.)"},{"step":"4","text":"Arrange the strips of bread around the inside of the basin with the smaller bread circle at the base. There should be no spaces between the bread slices."},{"step":"5","text":"Place the port and sugar in a saucepan with the water. Stir. Slowly bring to the boil. Add the fruits and cook gently for 8-10 min until soft but still holding their shape."},{"step":"6","text":"Spoon the fruit into the prepared basin. Cover with the larger circle of bread. Place a saucer on top of the pudding and weigh it down. Leave to cool."},{"step":"7","text":"Leave in the fridge overnight to allow the juices to soak through to the bread."},{"step":"8","text":"To turn the pudding out, carefully invert on a serving place. Cut into slices and serve."}],"title":"Scrumptious summer pudding"}