{"_id":"Souffledcheesecakewithstrawberries","preptime":"20","servings":"8","keywords":["diet@peanut-free","diet@corn-free","main ingredient@cheese","diet@yeast-free","cook method.hob, oven, grill@hob / oven","meal type@desserts","diet@shellfish-free"],"subtitle":"A light and fluffy cheesecake.","totaltime":"165","cooktime":"25","ingredients":[{"ingredient":"caster sugar","measure":"200 g"},{"ingredient":"plain flour","measure":"50 g"},{"ingredient":"eggs","measure":"4"},{"ingredient":"large eggs","measure":"2"},{"ingredient":"soured cream","measure":"200 ml"},{"ingredient":"lemon","measure":""},{"ingredient":"vanilla essence","measure":"3-4 drops"},{"ingredient":"powdered gelatine","measure":"2 tsp"},{"ingredient":"caster sugar","measure":"2 tsp"},{"ingredient":null,"measure":""},{"ingredient":"lemon","measure":"1"},{"ingredient":"strawberries","measure":"3-4"}],"method":[{"step":"1","text":"Preheat oven to 180&deg;C."},{"step":"2","text":"Place the whole eggs, 75 g of the caster sugar and the vanilla essence into a large bowl. Whisk vigorously with an electric hand whisk until the mixture is very thick and pale."},{"step":"3","text":"Carefully and gradually fold in the flour using a large metal spoon. Pour the mixture into a greased and lined 20 cm / 8 inch spring-clip cake tin. Smooth over the surface and bake in the oven for 25 min or until the sponge springs back when lightly pressed."},{"step":"4","text":"Leave to cool slightly before turning the sponge out. Remove the lining and leave to cool completely on a wire tray."},{"step":"5","text":"To make the filling: Beat together the egg yolks with the remaining caster sugar until pale and creamy. Fold in the soured cream."},{"step":"6","text":"Place the lemon juice in a small bowl and sprinkle over the gelatine. Leave to stand for 10 min. Then place over a pan of simmering water and heat until dissolved. Allow to cool slightly. Then fold into soured cream mixture with the lemon rind."},{"step":"7","text":"Whisk egg whites until stiff but not dry. Fold into the cream mixture. Spoon mixture into the lightly greased and lined 20 cm / 8 inch spring-clip cake tine. Slice the sponge in half and place one half on top of the filling. Cover and chill for about 2 hours."},{"step":"8","text":"Turn the cheesecake out onto a serving plate. Remove the greaseproof paper and top with the other half of sponge. Sprinkle the top liberally with caster sugar and decorate with lemon and strawberry slices."}],"title":"Souffled cheesecake with strawberries"}