{"_id":"SpeckledbreadBarabrith","preptime":"20","servings":"1","keywords":["cook method.hob, oven, grill@oven","diet@peanut-free","special collections@classic recipe","cuisine@british traditional","diet@corn-free","meal type@bread","cuisine@european.welsh","diet@shellfish-free","diet@egg-free"],"subtitle":"A traditional Welsh bread - speckled with dried fruit.","totaltime":"160","cooktime":"45","ingredients":[{"ingredient":"currants","measure":"225 g"},{"ingredient":"salt","measure":"[sup]1[/sup]/[sub]2[/sub] tsp"},{"ingredient":"mixed spice","measure":"[sup]1[/sup]/[sub]2[/sub] tsp"},{"ingredient":"lard","measure":"25 g"},{"ingredient":"butter","measure":"25 g"},{"ingredient":"caster sugar","measure":"50 g"},{"ingredient":"fresh yeast","measure":"20 g"},{"ingredient":"milk","measure":"250 ml"},{"ingredient":"strong plain flour","measure":"350 g"},{"ingredient":"sultanas","measure":"175 g"},{"ingredient":"mixed peel","measure":"25 g"}],"method":[{"step":"1","text":"Cream the yeast. Add the warm milk and blend well. Leave to stand for 10 min, or until the surface is covered with bubbles. "},{"step":"2","text":"Meanwhile, sift the flour with the salt and mixed spice. Rub in the lard or butter. Add the sugar, the fruit, peel and then the yeast liquid. "},{"step":"3","text":"Mix with a knife then your hands and check the consistency as flours do vary slightly in the amount of liquid they absorb. The dough should be soft and pliable. If too dry, add a little more warm milk, or milk and water. "},{"step":"4","text":"Continue kneading until smooth. This can be done by hand or with the dough hook of an electric mixer. If kneading by hand use the heel or base of the palm."},{"step":"5","text":"To check when the dough is adequately kneaded, simply press the dough with a floured finger. If the impression stays, then the dough requires more kneading. If it is ready, the impression will come out. Do NOT over-knead. "},{"step":"6","text":"Place back in the bowl. Cover with oiled cling film or a cloth and leave in a warm place for about 1 hour, or until the dough has doubled in size."},{"step":"7","text":"Preheat oven to 190&deg;C."},{"step":"8","text":"Knead again. This stage is known as 'knocking-back' the dough. Then form into a rectangular shape to fit into a lightly greased and warmed 1.15 - 1 <sup>3</sup>/<sub>8</sub> kg loaf tin. Cover the top of the tin with oiled cling film and leave for 35 min, or until the dough has risen to the top of the tin."},{"step":"9","text":"Place the bread in the oven for 45-50 min or until well risen and firm. To test, remove from the tin and knock the base, the bread should sound hollow. Allow to cool then slice and serve."}],"title":"Speckled bread  (Bara brith)"}