{"_id":"SpicedBramleypureeandfruitpancakebaskets","preptime":"20","servings":"6","keywords":["diet@vegetarian","cuisine@british contemporary","diet@peanut-free","diet@corn-free","occasion@entertaining","diet@citrus-free","diet@yeast-free","diet@shellfish-free","meal type@desserts","main ingredient@fruit","diet@demi-veg","cook method.hob, oven, grill@hob / oven"],"subtitle":"The sauce and pancakes for this impressive dessert can be made well in advance, leaving only the baskets and sauce to be reheated at the last minute.","totaltime":"30","cooktime":"10","ingredients":[{"ingredient":"mixed spice","measure":"1 [sup]1[/sup]/[sub]2[/sub] tsp"},{"ingredient":"vegetable oil","measure":"3-6 tsp"},{"ingredient":"bramley apple puree","measure":"300 ml"},{"ingredient":"butter","measure":"25 g"},{"ingredient":"vanilla essence","measure":"1 tsp"},{"ingredient":null,"measure":""},{"ingredient":"salt","measure":"1 pinch"},{"ingredient":"milk","measure":"200 ml"},{"ingredient":"flour","measure":"100 g"},{"ingredient":"eggs","measure":"2"}],"method":[{"step":"1","text":"Put flour, eggs, milk and salt into a processor. Blend until smooth."},{"step":"2","text":"Preheat oven to 190&deg;C."},{"step":"3","text":"Lightly oil a small to medium sized frying pan and heat over a medium heat. Make 6 pancakes in the usual way, using about 2-3 tablespoon of the batter each time and cooking until golden brown each side. Stack as they are cooked between sheets of baking parchment."},{"step":"4","text":"Lightly oil the outside of 6 ovenproof moulds (individual souffle dishes or pudding basins are ideal, but you can make excellent moulds by pressing a double layer of kitchen foil over any suitable small dish or glass and then removing). Place spaced apart on a lightly oiled baking sheet."},{"step":"5","text":"Drape a pancake over each mould, arranging them evenly into 'flutes'. Bake  in centre of the oven for 8-10 min, or until crisp and dark brown at the edges."},{"step":"6","text":"Remove from oven. Allow to cool. Leave on the moulds until needed. Increase oven temperature to 220&deg;C."},{"step":"7","text":"Heat the puree with the butter, vanilla and mixed spice in a small saucepan over a low \\ medium heat, stirring constantly until hot and bubbling."},{"step":"8","text":"Remove pancake baskets carefully from their moulds and arrange, open side up, on the greased baking sheet. Reheat for 2-3 min in the oven."},{"step":"9","text":"To serve, place each pancake basket on a heated plate and fill with some of the puree. "}],"title":"Spiced Bramley puree and fruit pancake baskets"}