{"_id":"Steakandkidneypudding","preptime":"15","servings":"6","keywords":["diet@peanut-free","special collections@classic recipe","cuisine@british traditional","diet@corn-free","special collections@weekend meal","diet@citrus-free","diet@shellfish-free","main ingredient@meat","meal type@main","cook method.hob, oven, grill@hob / oven","diet@egg-free"],"subtitle":"A great British family favourite","totaltime":"236","cooktime":"221","ingredients":[{"ingredient":"butter","measure":"75 g"},{"ingredient":"onions","measure":"175 g"},{"ingredient":"flour","measure":"25 g"},{"ingredient":"rump steaks","measure":"550 g"},{"ingredient":"ox kidneys","measure":"225 g"},{"ingredient":"red wine","measure":"150 ml"},{"ingredient":"beef stock","measure":"150 ml"},{"ingredient":"bouquet garni","measure":"1"},{"ingredient":"nutmeg","measure":"1 pinch"},{"ingredient":"button mushrooms","measure":"175 g"},{"ingredient":null,"measure":""},{"ingredient":"self-raising flour","measure":"225 g"},{"ingredient":"baking powder","measure":"[sup]1[/sup]/[sub]2[/sub] tsp"},{"ingredient":"seasoning","measure":""},{"ingredient":"dried thyme","measure":"1 pinch"},{"ingredient":"suet","measure":"100 g"}],"method":[{"step":"1","text":"Heat <sup>2</sup>/<sub>3</sub> of the butter in a large pan. Add the onions. Fry for 3-5 min until softened."},{"step":"2","text":"Toss the steak in the seasoned flour until well coated. Add the steak and kidney to the pan. Fry for 8-10 min, stirring frequently until well browned. Remove meat from pan. Keep warm with the onions."},{"step":"3","text":"Meanwhile, add the red wine, stock and mushrooms to the pan. Cover and simmer for 1 hour until meat is tender."},{"step":"4","text":"Sift the flour, baking powder and seasoning into a bowl. Stir in the thyme and suet and enough cold water to mix to a soft but not sticky dough."},{"step":"5","text":"Turn the dough out onto a lightly floured work surface. Roll out to a 25 cm (10in) round. Cut out a quarter and reserve for the lid."},{"step":"6","text":"Arrange the dough in a lightly buttered 1.15 litre (2pt) ovenproof pudding basin. Join the edges together so the base is evenly lined and any extra dough hangs over the rim of the basin."},{"step":"7","text":"Strain the liquid for the meat and reduce if necessary. Spoon the meat and mushroom mixture into the lined basin. Spoon over the juices, leaving a small gap between the top of the pudding and the rim of the basin."},{"step":"8","text":"Roll out the remaining pastry to form a lid. Moisten the edges of both lid and basin with a little water. Arrange the pastry lid on top of the filling. Flip over the pastry hanging over the edge and press down gently to seal well."},{"step":"9","text":"Cover the pudding with a lightly buttered piece of pleated foil, to allow for expansion. Tie securely around the rim with string. Using a length of foil, make a handle to wrap around the pudding to make it easier when lifting out."},{"step":"10","text":"Stand the basin on a trivet in a large saucepan. Pour in enough boiling water to come half way up the sides of the basin. Cover and steam for 2 <sup>1</sup>/<sub>1</sub> days, topping up the water when necessary. Do not turn out to serve but remove the foil and tie a clean napkin around the basin before serving."}],"title":"Steak and kidney pudding"}