{"_id":"Tagliatellewithgarlicandherbsauce-microwave","preptime":"5","servings":"2","keywords":["diet@vegetarian","diet@peanut-free","main ingredient@cheese","diet@corn-free","diet@citrus-free","diet@yeast-free","diet@shellfish-free","cook method@microwave","main ingredient@pasta","diet@demi-veg","convenience@serve with salad for complete meal","meal type@main","diet@egg-free","special collections@mediterranean"],"subtitle":"Garlic and herb soft cheese makes an easy base for the sauce, and combined with the freshly cooked pasta provides a simply delicious texture and creamy taste. ","totaltime":"19","cooktime":"14","ingredients":[{"ingredient":"button mushrooms","measure":"100 g"},{"ingredient":"butter","measure":"15 g"},{"ingredient":"tagliatelle verdi","measure":"175 g"},{"ingredient":"vegetable oil","measure":"3 tsp"},{"ingredient":"seasoning","measure":""},{"ingredient":"soft cheese with garlic and herbs","measure":"100 g-150"},{"ingredient":"single cream","measure":"45-60 ml"}],"method":[{"step":"1","text":"Place the butter in a bowl and cook on 100% (FULL) power for 30 sec, stirring once. Mix in the sliced mushrooms and cook on 100% (FULL) power for 1-2 min, or until the mushrooms are just cooked. Set aside."},{"step":"2","text":"Place the tagliatelle in a large casserole dish or bowl. Pour boiling water over to cover. Stir well with the oil and salt. Cover and cook on 100% (FULL) power for 3 min. Stir. Reduce power to 30% (MEDIUM LOW) for 7-8 min until pasta is al dente when tasted. "},{"step":"3","text":"Turn the garlic and herb cheese into a large dish. Heat gently on 30% (MEDIUM LOW) power for about 4 min. Stir in the cream gradually to make a smooth sauce."},{"step":"4","text":"Add a little of the pasta water to the sauce if necessary, to make a fairly thin consistency."},{"step":"5","text":"Season to taste. Stir in the mushrooms. Heat the sauce for a few minutes, on the medium low setting."},{"step":"6","text":"Drain the pasta thoroughly and run under boiling water to refresh. Drain well. Toss in the sauce to coat lightly. Spoon into a warmed serving dish. Serve immediately."}],"title":"Tagliatelle with garlic and herb sauce - microwave"}