{"_id":"Tarteaucitron","preptime":"25","servings":"4","keywords":["diet@vegetarian","cook method.hob, oven, grill@oven","diet@peanut-free","diet@corn-free","occasion@entertaining","diet@yeast-free","diet@shellfish-free","meal type@desserts","main ingredient@fruit","diet@demi-veg","cuisine@european.french","occasion@prepare-ahead entertaining"],"subtitle":"This beautiful lemon tart should be prepared in advance as it needs time to chill sufficiently. The delicate, refreshing flavours provide the perfect end to a pleasant meal.","totaltime":"315","cooktime":"80","ingredients":[{"ingredient":"salt","measure":"1 pinch"},{"ingredient":"plain flour","measure":"175 g"},{"ingredient":"lemons","measure":"3"},{"ingredient":"caster sugar","measure":"100 g"},{"ingredient":"caster sugar","measure":"2 tsp"},{"ingredient":"butter","measure":"75 g"},{"ingredient":"egg yolk","measure":"1"},{"ingredient":"unsalted butter","measure":"25 g"}],"method":[{"step":"1","text":"Preheat oven to 200&deg;C."},{"step":"2","text":"Sift the flour and salt together in a bowl. Rub in the butter, until the mixture resembles fine breadcrumbs. Stir in the sugar, egg yolk and enough cold water to form a smooth dough. Wrap in cling film. Chill for 30 min. "},{"step":"3","text":"Roll the pastry out on a lightly floured surface. Use to line a 16 cm round, 3 <sup>1</sup>/<sub>2</sub>cm deep, fluted flan dish. Prick the base, line with greaseproof paper and baking beans. Bake for 10 min. Remove the paper and beans and cook for a further 5 min."},{"step":"4","text":"Reduce oven temperature to 160&deg;C."},{"step":"5","text":"Whisk the eggs until frothy. Finely grate the rind from the lemons and add to the eggs. Squeeze the juice from 2 of the lemons and add to the eggs. Whisk in the sugar and butter then pour into the pastry case. Smooth over the surface. "},{"step":"6","text":"Place on a baking tray. Bake in oven for 1 hour, or until filling is just set."},{"step":"7","text":"Meanwhile, remove the rind and pith from the remaining lemon and cut into thin slices. Remove the tart from the oven and arrange the slices around the edge of the tart. Return to the oven for a further 5 min, or until set. "},{"step":"8","text":"Leave to cool on a wire rack completely. Then remove from the flan case. Chill completely before serving in slices."}],"title":"Tarte au citron"}