{"_id":"Toastedpinenutandsatsumapreserve","preptime":"25","servings":"1","keywords":["diet@vegetarian","cook method.hob, oven, grill@hob","diet@dairy-free","diet@wheat-free","diet@peanut-free","diet@corn-free","diet@shellfish-free","main ingredient@fruit","meal type@misc","diet@vegan","warning@nuts","diet@demi-veg","diet@egg-free","diet@gluten-free","diet@cow dairy-free"],"subtitle":"A variation on the traditional marmalade, this sweet and crunchy preserve is lovely on toast.","totaltime":"95","cooktime":"70","ingredients":[{"ingredient":"satsumas","measure":"900 g"},{"ingredient":"pine nuts","measure":"50 g"},{"ingredient":"water","measure":"475 ml"},{"ingredient":"granulated sugar","measure":"900 g"},{"ingredient":"orange liqueur","measure":"3 tsp"}],"method":[{"step":"1","text":"Place the pine nuts in a clean, dry frying pan and toast over a medium heat for 3-5 min or until lightly browned. Remove from heat and leave to cool."},{"step":"2","text":"Wipe the satsumas and, using a potato peeler, carefully pare the peel from them, leaving the white pith on the fruit. "},{"step":"3","text":"Using a sharp knife, cut the peel into very thin strips and place in a pan with 150 ml water. Bring to the boil, cover and simmer for 45 min, or until tender."},{"step":"4","text":"Meanwhile, cut the satsumas in half and squeeze the juice from them. Add enough cold water to make quantity up to 475 ml.  Reserve all satsuma pips, wrap in a piece of muslin, and tie securely with a piece of string. Add the muslin bags to the pan with the satsuma shells and the second quantity of water. Bring to the boil, cover and simmer for 1 hour. "},{"step":"5","text":"Strain the liquid into the saucepan containing the satsuma peel. Stir in the sugar and measured out juice mixture. Bring to the boil, stirring constantly until the sugar has dissolved."},{"step":"6","text":"Once dissolved, boil rapidly for 5-10 min until setting point is reached. To test for setting point, spoon a little preserve on to a cold plate then push your finger through it, and if it wrinkles the setting point has been reached.  If not, continue to boil, testing frequently until the setting point has been reached."},{"step":"7","text":"Add the pine nuts and orange liqueur to the pan, bring to the boil and boil for a further 2 min.  Remove from heat. Leave to cool slightly. Then pour into warm, dry sterilised jars. Cover with wax discs. Seal, label and store in a cool dry place until required."}],"title":"Toasted pine nut and satsuma preserve"}