{"_id":"Tunasouffle","preptime":"20","servings":"4","keywords":["diet@peanut-free","diet@corn-free","occasion@entertaining","main ingredient@egg","diet@shellfish-free","main ingredient@fish","diet@demi-veg","meal type@main","cook method.hob, oven, grill@hob / oven"],"subtitle":"A souffle dish that is bound to impress. Make sure you take it to the table quickly before it sinks for maximum effect.","totaltime":"50","cooktime":"30","ingredients":[{"ingredient":"olive oil","measure":"[sup]1[/sup]/[sub]2[/sub] tsp"},{"ingredient":"low fat spread","measure":"25 g"},{"ingredient":"sunflower oil","measure":"[sup]1[/sup]/[sub]2[/sub] tsp"},{"ingredient":"seasoning","measure":""},{"ingredient":"lemon juice","measure":"[sup]1[/sup]/[sub]2[/sub] tsp"},{"ingredient":"plain flour","measure":"50 g"},{"ingredient":"breadcrumbs","measure":"6 tsp"},{"ingredient":"parmesan cheese","measure":"6 tsp"},{"ingredient":"milk","measure":"200 ml"},{"ingredient":"canned tuna in brine","measure":"200 g"},{"ingredient":"eggs","measure":"4"}],"method":[{"step":"1","text":"Preheat oven to 190&deg;C."},{"step":"2","text":"Brush the souffle dish lightly with oil. Shake the breadcrumbs around the side and base, to coat. "},{"step":"3","text":"Separate the eggs. Put 2 yolks only into a small bowl and the 4 whites into a large bowl. Make sure you do not get any yolk in with the whites - if you do, then scoop it out with a spoon. "},{"step":"4","text":"Put the low fat spread, flour and milk into a saucepan. Bring slowly to the boil, stirring all the time with a wooden spoon and cook for 2-3 min until it becomes thick and smooth. Simmer for a further 30 seconds. Then remove from heat. Mix in the cheese. "},{"step":"5","text":"Mash the tuna well with a fork. Mix in with the 2 egg yolks and stir into the sauce. Season well. "},{"step":"6","text":"Stand the bowl of egg whites on a damp dish cloth to stop it slipping. Add the lemon juice and whisk steadily until you have a firm, white, glossy foam that stands in soft peaks. You can tell when the foam is ready if you look for the wiggle! If the foam wiggles a bit on the whisk, it's ready. But don't over beat otherwise it will become dry. "},{"step":"7","text":"Beat 15 ml of whites into the sauce, then scoop in the rest. Using a metal spoon, gently fold in the white foam in a figure of 8 direction. Do not over stir. "},{"step":"8","text":"Spoon into the prepared dish and put the dish in the preheated oven using oven gloves. Cook for 20-25 min until high and golden. Don't peek for 20 min or it will sink. Serve immediately."}],"title":"Tuna souffle"}